# 1.序列的切片
"""
序列是内容连续、有序、可使用下标索引的一类数据容器
列表、元组、字符串均可以视为序列
切片:取出序列中的子序列

语法:序列[起始下标:结束下标:步长]
1)表示从指定位置开始依次取出元素到指定位置(不含结束下标)结束得到新序列.
2)步长为N代表每次跳过N-1个元素取;步长为负数表示反向取;步长默认值为1
3)切片不影响序列本身,因为元组和字符串不可修改
4)注意反向取时的起始下标更大结束下标更小,且依旧遵循含起始不含结束下标
"""
my_list = [0,1,2,3,4,5,6]
result1 = my_list[1:4:1]
print(result1)
my_tuple = (0,1,2,3,4,5,6)
result2 = my_tuple[:]   #表示从头到尾，步长默认1不需要写
print(result2)
my_str = "01234567"
result3 = my_str[::2]
print(result3)
result4 = my_str[::-1]  #相当于将序列反转了
print(result4)
# 案例
example = "万过薪月，员序程马黑来，nohtyP学"
res = example[9:4:-1]
print(res)




















